'''Подвиг 2. На вход программы поступает строка с названиями пунктов меню, записанные в одну строчку через пробел. 
Необходимо задать функцию с именем get_menu, которая преобразует эту строку в список из слов и возвращает 
этот список. Сигнатура функции, следующая:

def get_menu(s): ...

Определите декоратор для этой функции с именем show_menu, который отображает список на экран в формате:
1. Пункт_1
2. Пункт_1
...
N. Пункт_N

Примените декоратор show_menu к функции get_menu, используя оператор @. Более ничего в программе делать не нужно. Сами функции не вызывать.

P.S. В программе необходимо только объявить декоратор и применить его к функции, более ничего делать не нужно.

Sample Input:
Главная Добавить Удалить Выйти

Sample Output:
1. Главная
2. Добавить
3. Удалить
4. Выйти'''


def show_menu(func: callable) -> callable:
    def create_menu(*args) -> str:
        [print(f'{i}. {s}') for i, s in enumerate(func(*args), start=1)]
    return create_menu


@show_menu
def get_menu(s: str) -> list:
    return s.split()


print(get_menu("Главная Добавить Удалить Выйти"))
